#### Terraform Plan - development

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=curated-knot-develop/artifactregistry.googleapis.com]
google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=curated-knot-develop/secretmanager.googleapis.com]
google_project_service.apis["cloudbuild.googleapis.com"]: Refreshing state... [id=curated-knot-develop/cloudbuild.googleapis.com]
google_project_service.apis["vpcaccess.googleapis.com"]: Refreshing state... [id=curated-knot-develop/vpcaccess.googleapis.com]
google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=curated-knot-develop/run.googleapis.com]
google_project_service.apis["sqladmin.googleapis.com"]: Refreshing state... [id=curated-knot-develop/sqladmin.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=curated-knot-develop/iam.googleapis.com]
google_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=curated-knot-develop/iamcredentials.googleapis.com]
module.api_service_account.google_service_account.account: Refreshing state... [id=projects/curated-knot-develop/serviceAccounts/curated-knot-api@curated-knot-develop.iam.gserviceaccount.com]
module.networking.google_compute_address.nat_ip[0]: Refreshing state... [id=projects/curated-knot-develop/regions/asia-south1/addresses/curated-knot-nat-ip]
module.networking.google_compute_router.router[0]: Refreshing state... [id=projects/curated-knot-develop/regions/asia-south1/routers/curated-knot-router]
module.networking.google_vpc_access_connector.connector: Refreshing state... [id=projects/curated-knot-develop/locations/asia-south1/connectors/vpc-connector]
module.static_assets.google_storage_bucket.bucket: Refreshing state... [id=curated-knot-dev-static-assets]
google_artifact_registry_repository.images: Refreshing state... [id=projects/curated-knot-develop/locations/asia-south1/repositories/curated-knot-images]
module.cloud_sql.google_sql_database_instance.main: Refreshing state... [id=curated-knot-db]
module.networking.google_compute_router_nat.nat[0]: Refreshing state... [id=curated-knot-develop/asia-south1/curated-knot-router/curated-knot-nat]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_service_account.google_project_iam_member.roles["roles/cloudsql.client"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:curated-knot-api@curated-knot-develop.iam.gserviceaccount.com"
      + project = "curated-knot-develop"
      + role    = "roles/cloudsql.client"
    }

  # module.api_service_account.google_project_iam_member.roles["roles/cloudtrace.agent"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:curated-knot-api@curated-knot-develop.iam.gserviceaccount.com"
      + project = "curated-knot-develop"
      + role    = "roles/cloudtrace.agent"
    }

  # module.api_service_account.google_project_iam_member.roles["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:curated-knot-api@curated-knot-develop.iam.gserviceaccount.com"
      + project = "curated-knot-develop"
      + role    = "roles/logging.logWriter"
    }

  # module.api_service_account.google_project_iam_member.roles["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:curated-knot-api@curated-knot-develop.iam.gserviceaccount.com"
      + project = "curated-knot-develop"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.api_service_account.google_project_iam_member.roles["roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:curated-knot-api@curated-knot-develop.iam.gserviceaccount.com"
      + project = "curated-knot-develop"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.cloud_run_api.google_cloud_run_service_iam_member.public will be created
  + resource "google_cloud_run_service_iam_member" "public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-south1"
      + member   = "allUsers"
      + project  = "curated-knot-develop"
      + role     = "roles/run.invoker"
      + service  = "curated-knot-api"
    }

  # module.cloud_run_api.google_cloud_run_v2_service.api will be created
  + resource "google_cloud_run_v2_service" "api" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-south1"
      + name                    = "curated-knot-api"
      + observed_generation     = (known after apply)
      + project                 = "curated-knot-develop"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = 80
          + service_account                  = "curated-knot-api@curated-knot-develop.iam.gserviceaccount.com"
          + timeout                          = "300s"

          + containers {
              + image = "asia-south1-docker.pkg.dev/curated-knot-develop/curated-knot-images/curated-knot-api:develop"

              + env {
                  + name  = "NODE_ENV"
                  + value = "development"
                }
              + env {
                  + name  = "ALLOWED_ORIGINS"
                  + value = "https://develop.thecuratedknot.com,https://develop-admin.thecuratedknot.com"
                }
              + env {
                  + name = "CLERK_SECRET_KEY"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "clerk-secret-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "DATABASE_URL"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "database-url"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "MONGODB_URI"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "mongodb-uri"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "PRISMA_DATABASE_URL"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "prisma-database-url"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name = "SENTRY_DSN"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "sentry-dsn"
                          + version = "latest"
                        }
                    }
                }

              + ports {
                  + container_port = 8080
                  + name           = "http1"
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 1
                  + initial_delay_seconds = 0
                  + period_seconds        = 240
                  + timeout_seconds       = 240

                  + tcp_socket {
                      + port = 8080
                    }
                }

              + volume_mounts {
                  + mount_path = "/cloudsql"
                  + name       = "cloudsql"
                }
            }

          + scaling {
              + max_instance_count = 5
              + min_instance_count = 0
            }

          + volumes {
              + name = "cloudsql"

              + cloud_sql_instance {
                  + instances = [
                      + "curated-knot-develop:asia-south1:curated-knot-db",
                    ]
                }
            }

          + vpc_access {
              + connector = "projects/curated-knot-develop/locations/asia-south1/connectors/vpc-connector"
              + egress    = "ALL_TRAFFIC"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloud_run_url                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Triggered by: @abhinavjain-tck, Action: `pull_request`*

> Comment `/apply` to apply this plan.